_src/wiki/2016-09-21-org-mode_some_tips.org
#+title: org-mode some tips
#+date: <2016-09-21 20:48>
#+filetags: emacs org-mode

* 纯文本的例子

你可以包含进来一些纯文本的例子，这不属于准备的范畴。这些例子会等宽排版，所以适用
于代码以及其他类似的情况：
#+BEGIN_SRC org-mode

#+BEGIN_EXAMPLE
Some example from a text file.
#+END_EXAMPLE

#+END_SRC

为了简单化，一些小型的例子也可以将各行以冒号开头。冒号前面可以有空格：
#+BEGIN_EXAMPLE
Here is an example
   : Some example from a text file.

#+END_EXAMPLE

对于一些程序设计语言的源代码以及一些其他的文本，可以被 Emacs 的字体锁（font-lock）
特殊标记，你也可以让它们像在Emacs的缓冲区中那样显示：
#+BEGIN_EXAMPLE
#+BEGIN_SRC emacs-lisp
(defun org-xor (a b)
   "Exclusive or."
   (if a (not b) b))
#+END_SRC

#+END_EXAMPLE

为了能在支持这种语言的专门的缓冲区中编辑例子，可以用 C-c , 启动和退出编辑缓冲区。


* 包含文件

当导出文档时，你可以包含其他文件中的内容。比如，想包含你的“.emacs”文件，你可以用：
: #+INCLUDE: "~/.emacs" src emacs-lisp

可选的第二个第三个参数是组织方式（例如，“quote”，“example”，或者“src”），如果是
“src”，语言用来格式化内容。组织方式是可选的，如果不给出，文本会被当作 Org 模式的
正常处理。用 C-c ,可以访问包含的文件。


* 段落、分行和引用

段落之间至少要有一空行。如果你想实现段内分行，可以在行后加上“\\”。

要想在一个区域内实现分行，而其他地方使用正常格式，你可以使用下面的构造，它也可以
用来实现诗歌的格式：
#+BEGIN_EXAMPLE
#+BEGIN_VERSE
 Great clouds overhead
 Tiny black birds rise and fall
 Snow covers Emacs

     -- AlexSchroeder
#+END_VERSE

#+END_EXAMPLE

当从另外一个文档中引用一段话时通过会让它左右都缩进。在 Org 文档中可以这样作引用：
#+BEGIN_EXAMPLE
#+BEGIN_QUOTE
Everything should be made as simple as possible,
but not any simpler -- Albert Einstein
#+END_QUOTE

#+END_EXAMPLE

如果你想让某些文本居中，可以这样：
#+BEGIN_EXAMPLE
#+BEGIN_CENTER
Everything should be made as simple as possible, \\
but not any simpler
#+END_CENTER
#+END_EXAMPLE
